package dummy;

public class DummyAreaCreate {

	public static void main(String[] args) {
		String[][] str = new String[9][2];
		str[0][0] = "'강동','서울특별시 강동구 성내동 천호대로170길 106-6',37.530862, 127.130925";
		str[0][1] = "서울특별시 강동구 성내동 천호대로170길 106-6";
		
		str[1][0] = "'강동','서울특별시 강동구 성내2동 199-6',37.534172, 127.133028";
		str[1][1] = "서울특별시 강동구 성내2동 199-6";
		
		str[2][0] = "'강동','서울특별시 강동구 성내3동 413-20',37.530076, 127.136267";
		str[2][1] = "서울특별시 강동구 성내3동 413-20";
		
		str[3][0] = "'강동','서울특별시 강동구 암사1동 557-2',37.548936, 127.131899";
		str[3][1] = "서울특별시 강동구 암사1동 557-2";
		
		str[4][0] = "'강동','서울특별시 강동구 암사동 고덕로20길 39',37.552942, 127.133476";
		str[4][1] = "서울특별시 강동구 암사동 고덕로20길 39";
		
		str[5][0] = "'강동','서울특별시 강동구 암사동 425-161',37.550967, 127.137367";
		str[5][1] = "서울특별시 강동구 암사동 425-161";
		
		str[6][0] = "'강동','서울특별시 강동구 상일동 상일로7길',37.549831, 127.171735";
		str[6][1] = "서울특별시 강동구 상일동 상일로7길";
		
		str[7][0] = "'강동','서울특별시 강동구 상일동 336',37.546114, 127.167894";
		str[7][1] = "서울특별시 강동구 상일동 336";
		
		str[8][0] = "'강동','서울특별시 강동구 고덕2동 상일로23길',37.560450, 127.170180";
		str[8][1] = "서울특별시 강동구 고덕2동 상일로23길";
		
		int testNum = 4321;
		
		for(int j=0;j<str.length; j++ ) {
			System.out.println("insert into parking_area values(pa_seq.nextval,'서울',"+ str[j][0]+");");
			System.out.println();
			String s = "가나다라마바사아자차카타파하";
			
			
			for(int i=1;i<=20;i++) {
				System.out.println("insert into parking_area_personal values('" + str[j][1] + "','25-" + s.charAt(j) + "-" + i + "','test" + testNum +"');");
				testNum += 1;
			}
			System.out.println();
		}
		
		System.out.println("commit;");
	}

}
